# FrictionFactor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..FrictionFactor Property
PipePressureDropData Class See Also
---
The friction factor of the pipe.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double FrictionFactor { get; set; }
```

Visual Basic
---
```text
Public Property FrictionFactor As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FrictionFactor {
	double get ();
	void set (double value);
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace